In [4]:
import numpy as np
import pandas as pd

In [5]:
file=r"C:\Users\G P DOMBALE\Desktop\WorkFlow\Software\DataSet\bank-full.csv"

In [6]:
bd=pd.read_csv(file, delimiter=';')

In [7]:
bd

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45206,51,technician,married,tertiary,no,825,no,no,cellular,17,nov,977,3,-1,0,unknown,yes
45207,71,retired,divorced,primary,no,1729,no,no,cellular,17,nov,456,2,-1,0,unknown,yes
45208,72,retired,married,secondary,no,5715,no,no,cellular,17,nov,1127,5,184,3,success,yes
45209,57,blue-collar,married,secondary,no,668,no,no,telephone,17,nov,508,4,-1,0,unknown,no
45210,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other,no

In [8]:
bd.describe()

,age,balance,day,duration,campaign,pdays,previous
count,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,40.936210,1362.272058,15.806419,258.163080,2.763841,40.197828,0.580323
std,10.618762,3044.765829,8.322476,257.527812,3.098021,100.128746,2.303441
min,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
25%,33.000000,72.000000,8.000000,103.000000,1.000000,-1.000000,0.000000
50%,39.000000,448.000000,16.000000,180.000000,2.000000,-1.000000,0.000000
75%,48.000000,1428.000000,21.000000,319.000000,3.000000,-1.000000,0.000000
max,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000

In [9]:
bd.nunique()

age            77
job            12
marital         3
education       4
default         2
balance      7168
housing         2
loan            2
contact         3
day            31
month          12
duration     1573
campaign       48
pdays         559
previous       41
poutcome        4
y               2
dtype: int64

In [10]:
bd['age'].describe()

count    45211.000000
mean        40.936210
std         10.618762
min         18.000000
25%         33.000000
50%         39.000000
75%         48.000000
max         95.000000
Name: age, dtype: float64

In [11]:
bd['age'].mean(), bd['age'].median()

(40.93621021432837, 39.0)

In [12]:
bd['job'].value_counts()

blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: job, dtype: int64

In [13]:
k = bd['job'].value_counts()

In [14]:
k.values

array([9732, 9458, 7597, 5171, 4154, 2264, 1579, 1487, 1303, 1240,  938,
        288], dtype=int64)

In [15]:
k.index

Index(['blue-collar', 'management', 'technician', 'admin.', 'services',
       'retired', 'self-employed', 'entrepreneur', 'unemployed', 'housemaid',
       'student', 'unknown'],
      dtype='object')

In [16]:
k.index[k.values>1500]

Index(['blue-collar', 'management', 'technician', 'admin.', 'services',
       'retired', 'self-employed'],
      dtype='object')

In [17]:
k[k.values>1500]

blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
Name: job, dtype: int64

In [19]:
pd.crosstab(bd['housing'], bd['default'])

default     no  yes
housing
no       19701  380
yes      24695  435

In [18]:
pd.crosstab(bd['age'], bd['default'])

default   no  yes
age
18        12    0
19        35    0
20        50    0
21        77    2
22       129    0
..       ...  ...
90         2    0
92         2    0
93         2    0
94         1    0
95         2    0

[77 rows x 2 columns]

In [22]:
bd.select_dtypes(['object']).columns

Index(['job', 'marital', 'education', 'default', 'housing', 'loan', 'contact',
       'month', 'poutcome', 'y'],
      dtype='object')

In [25]:
bd.select_dtypes(['number']).columns

Index(['age', 'balance', 'day', 'duration', 'campaign', 'pdays', 'previous'], dtype='object')

In [24]:
bd.select_dtypes(['boolean']).columns

Index([], dtype='object')

In [28]:
bd.groupby(['default'])['age'].median()

default
no     39.0
yes    38.0
Name: age, dtype: float64

In [31]:
bd.groupby(['default','loan']).mean()

                    age      balance        day    duration  campaign  \
default loan
no      no    41.031773  1496.358609  15.759138  259.792086  2.746456
        yes   40.585194   815.026213  15.993519  251.611551  2.812473
yes     no    39.336576  -121.669261  16.198444  242.595331  3.033074
        yes   39.873754  -164.870432  16.704319  233.172757  3.345515

                  pdays  previous
default loan
no      no    41.486850  0.595974
        yes   35.845024  0.532479
yes     no    19.780156  0.260700
        yes   15.076412  0.282392

In [32]:
bd.groupby(['default','loan'])['age'].mean()

default  loan
no       no      41.031773
         yes     40.585194
yes      no      39.336576
         yes     39.873754
Name: age, dtype: float64

In [33]:
bd.groupby(['default','loan'])['day','balance'].mean()

C:\Users\G P DOMBALE\AppData\Local\Temp\ipykernel_34532\3097949283.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  bd.groupby(['default','loan'])['day','balance'].mean()

                    day      balance
default loan
no      no    15.759138  1496.358609
        yes   15.993519   815.026213
yes     no    16.198444  -121.669261
        yes   16.704319  -164.870432

In [36]:
bd.groupby(['default']).mean()

,age,balance,day,duration,campaign,pdays,previous
default,,,,,,,
no,40.961934,1389.806424,15.795792,258.512749,2.756780,40.604536,0.586044
yes,39.534969,-137.624540,16.385276,239.115337,3.148466,18.042945,0.268712

In [37]:
bd.groupby(['default'])['age'].mean()

default
no     40.961934
yes    39.534969
Name: age, dtype: float64